zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_GDET.h
/*
** ###################################################################
**     Processors:          MCXW70ACMFT
**                          MCXW70ACMMP
**                          MCXW70ADMFT
**                          MCXW70ADMMP
**
**     Version:             rev. 1.0, 2026-01-09
**     Build:               b260813
**
**     Abstract:
**         CMSIS Peripheral Access Layer for GDET
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2026-01-09)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file PERI_GDET.h
 * @version 1.0
 * @date 2026-01-09
 * @brief CMSIS Peripheral Access Layer for GDET
 *
 * CMSIS Peripheral Access Layer for GDET
 */

#if !defined(PERI_GDET_H_)
#define PERI_GDET_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW70ACMFT) || defined(CPU_MCXW70ACMMP))
#include "MCXW70AC_COMMON.h"
#elif (defined(CPU_MCXW70ADMFT) || defined(CPU_MCXW70ADMMP))
#include "MCXW70AD_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- GDET Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GDET_Peripheral_Access_Layer GDET Peripheral Access Layer
 * @{
 */

/** GDET - Register Layout Typedef */
typedef struct {
  __IO uint32_t GDET_UPDATE_TIMER;                 /**< Update timer control., offset: 0x0 */
       uint8_t RESERVED_0[512];
  __IO uint32_t GDET_RCTRL1;                       /**< GDET control., offset: 0x204 */
  __IO uint32_t GDET_RENABLE1;                     /**< GDET enable., offset: 0x208 */
  __IO uint32_t GDET_RFORCE_ALARM1;                /**< GDET force alarm., offset: 0x20C */
  __I  uint32_t GDET_RSTATUS1;                     /**< GDET status readout., offset: 0x210 */
  __I  uint32_t GDET_RRESULT1;                     /**< GDET result., offset: 0x214 */
       uint8_t RESERVED_1[8];
  __IO uint32_t GDET_RMARGIN1;                     /**< Margin and target definition., offset: 0x220 */
  __IO uint32_t GDET_RREF1;                        /**< Reference limits for mode 0., offset: 0x224 */
  __IO uint32_t GDET_RMARGIN1_MODE1;               /**< Margin and target definition for mode 1., offset: 0x228 */
  __IO uint32_t GDET_RREF1_MODE1;                  /**< Reference limits for mode 1., offset: 0x22C */
  __IO uint32_t GDET_RMARGIN1_MODE2;               /**< Margin and target definition for mode 2., offset: 0x230 */
  __IO uint32_t GDET_RREF1_MODE2;                  /**< Reference limits for mode 2., offset: 0x234 */
       uint8_t RESERVED_2[1488];
  __IO uint32_t GDET_DLY_CTRL;                     /**< GDET delay control., offset: 0x808 */
  __IO uint32_t GDET_CTRL_CLR;                     /**< GDET clear control., offset: 0x80C */
       uint8_t RESERVED_3[2028];
  __I  uint32_t GDET_IP_VERSION;                   /**< IP Version., offset: 0xFFC */
} GDET_Type;

/* ----------------------------------------------------------------------------
   -- GDET Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GDET_Register_Masks GDET Register Masks
 * @{
 */

/*! @name GDET_UPDATE_TIMER - Update timer control. */
/*! @{ */

#define GDET_GDET_UPDATE_TIMER_UPD_RATE_MASK     (0xFU)
#define GDET_GDET_UPDATE_TIMER_UPD_RATE_SHIFT    (0U)
/*! UPD_RATE - Update rate. */
#define GDET_GDET_UPDATE_TIMER_UPD_RATE(x)       (((uint32_t)(((uint32_t)(x)) << GDET_GDET_UPDATE_TIMER_UPD_RATE_SHIFT)) & GDET_GDET_UPDATE_TIMER_UPD_RATE_MASK)

#define GDET_GDET_UPDATE_TIMER_UPD_STOP_MASK     (0x10U)
#define GDET_GDET_UPDATE_TIMER_UPD_STOP_SHIFT    (4U)
/*! UPD_STOP - Update stop.
 *  0b0..Periodic update pulses are generated.
 *  0b1..No periodic update pulses are generated. Individual pulses can be forced through UPD_MAN.
 */
#define GDET_GDET_UPDATE_TIMER_UPD_STOP(x)       (((uint32_t)(((uint32_t)(x)) << GDET_GDET_UPDATE_TIMER_UPD_STOP_SHIFT)) & GDET_GDET_UPDATE_TIMER_UPD_STOP_MASK)

#define GDET_GDET_UPDATE_TIMER_UPD_MAN_MASK      (0x20U)
#define GDET_GDET_UPDATE_TIMER_UPD_MAN_SHIFT     (5U)
/*! UPD_MAN - Manual update pulse. */
#define GDET_GDET_UPDATE_TIMER_UPD_MAN(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_UPDATE_TIMER_UPD_MAN_SHIFT)) & GDET_GDET_UPDATE_TIMER_UPD_MAN_MASK)

#define GDET_GDET_UPDATE_TIMER_RFU_MASK          (0xFFFFFFC0U)
#define GDET_GDET_UPDATE_TIMER_RFU_SHIFT         (6U)
/*! RFU - Reserved. */
#define GDET_GDET_UPDATE_TIMER_RFU(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_UPDATE_TIMER_RFU_SHIFT)) & GDET_GDET_UPDATE_TIMER_RFU_MASK)
/*! @} */

/*! @name GDET_RCTRL1 - GDET control. */
/*! @{ */

#define GDET_GDET_RCTRL1_RCHG_SEL1_MASK          (0x3U)
#define GDET_GDET_RCTRL1_RCHG_SEL1_SHIFT         (0U)
/*! RCHG_SEL1 - Change select.
 *  0b00..Chg = Minimum result value of last period
 *  0b01..Chg = Maximum result value of last period
 *  0b10..Chg = Caculated average of min and max result values of last period
 *  0b11..Chg = Reference is fixed to GDET_CTRL1.TARGET1
 */
#define GDET_GDET_RCTRL1_RCHG_SEL1(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RCHG_SEL1_SHIFT)) & GDET_GDET_RCTRL1_RCHG_SEL1_MASK)

#define GDET_GDET_RCTRL1_RWEIGHT1_MASK           (0xCU)
#define GDET_GDET_RCTRL1_RWEIGHT1_SHIFT          (2U)
/*! RWEIGHT1 - Weight.
 *  0b00..Ref.i = Chg
 *  0b01..Ref.i = 1/2 * Ref.i-1 + 1/2 * Chg
 *  0b10..Ref.i = 3/4 * Ref.i-1 + 1/4 * Chg
 *  0b11..Ref.i = 7/8 * Ref.i-1 + 1/8 * Chg
 */
#define GDET_GDET_RCTRL1_RWEIGHT1(x)             (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RWEIGHT1_SHIFT)) & GDET_GDET_RCTRL1_RWEIGHT1_MASK)

#define GDET_GDET_RCTRL1_RIGN_ERR1_MASK          (0x10U)
#define GDET_GDET_RCTRL1_RIGN_ERR1_SHIFT         (4U)
/*! RIGN_ERR1 - Ignore error.
 *  0b0..Alarms force min/max to default.
 *  0b1..Alarms do not force min/max.
 */
#define GDET_GDET_RCTRL1_RIGN_ERR1(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RIGN_ERR1_SHIFT)) & GDET_GDET_RCTRL1_RIGN_ERR1_MASK)

