zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_GDET.h
#define GDET_GDET_RCTRL1_RFU_MASK                (0x60U)
#define GDET_GDET_RCTRL1_RFU_SHIFT               (5U)
/*! RFU - Reserved. */
#define GDET_GDET_RCTRL1_RFU(x)                  (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RFU_SHIFT)) & GDET_GDET_RCTRL1_RFU_MASK)

#define GDET_GDET_RCTRL1_RMEAS_TIME1_MASK        (0x180U)
#define GDET_GDET_RCTRL1_RMEAS_TIME1_SHIFT       (7U)
/*! RMEAS_TIME1 - Measurement time. */
#define GDET_GDET_RCTRL1_RMEAS_TIME1(x)          (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RMEAS_TIME1_SHIFT)) & GDET_GDET_RCTRL1_RMEAS_TIME1_MASK)

#define GDET_GDET_RCTRL1_RFU3_MASK               (0x200U)
#define GDET_GDET_RCTRL1_RFU3_SHIFT              (9U)
/*! RFU3 - Reserved. */
#define GDET_GDET_RCTRL1_RFU3(x)                 (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RFU3_SHIFT)) & GDET_GDET_RCTRL1_RFU3_MASK)

#define GDET_GDET_RCTRL1_RFU1_MASK               (0xFC00U)
#define GDET_GDET_RCTRL1_RFU1_SHIFT              (10U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RCTRL1_RFU1(x)                 (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RFU1_SHIFT)) & GDET_GDET_RCTRL1_RFU1_MASK)

#define GDET_GDET_RCTRL1_RFU4_MASK               (0xFF0000U)
#define GDET_GDET_RCTRL1_RFU4_SHIFT              (16U)
/*! RFU4 - Reserved. */
#define GDET_GDET_RCTRL1_RFU4(x)                 (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RFU4_SHIFT)) & GDET_GDET_RCTRL1_RFU4_MASK)

#define GDET_GDET_RCTRL1_RFU2_MASK               (0xFF000000U)
#define GDET_GDET_RCTRL1_RFU2_SHIFT              (24U)
/*! RFU2 - Reserved. */
#define GDET_GDET_RCTRL1_RFU2(x)                 (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RCTRL1_RFU2_SHIFT)) & GDET_GDET_RCTRL1_RFU2_MASK)
/*! @} */

/*! @name GDET_RENABLE1 - GDET enable. */
/*! @{ */

#define GDET_GDET_RENABLE1_REN1_MASK             (0x1U)
#define GDET_GDET_RENABLE1_REN1_SHIFT            (0U)
/*! REN1 - GDET enable.
 *  0b0..Reference clock is not requested.
 *  0b1..Reference clock is requested. This enables GDET.
 */
#define GDET_GDET_RENABLE1_REN1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RENABLE1_REN1_SHIFT)) & GDET_GDET_RENABLE1_REN1_MASK)

#define GDET_GDET_RENABLE1_RFU_MASK              (0xFFFFFFFEU)
#define GDET_GDET_RENABLE1_RFU_SHIFT             (1U)
/*! RFU - Reserved. */
#define GDET_GDET_RENABLE1_RFU(x)                (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RENABLE1_RFU_SHIFT)) & GDET_GDET_RENABLE1_RFU_MASK)
/*! @} */

/*! @name GDET_RFORCE_ALARM1 - GDET force alarm. */
/*! @{ */

#define GDET_GDET_RFORCE_ALARM1_POS_ALARM1_MASK  (0x1U)
#define GDET_GDET_RFORCE_ALARM1_POS_ALARM1_SHIFT (0U)
/*! POS_ALARM1 - Positve alarm.
 *  0b0..No positive alarm pulse.
 *  0b1..Forces a positive alarm pulse.
 */
#define GDET_GDET_RFORCE_ALARM1_POS_ALARM1(x)    (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RFORCE_ALARM1_POS_ALARM1_SHIFT)) & GDET_GDET_RFORCE_ALARM1_POS_ALARM1_MASK)

#define GDET_GDET_RFORCE_ALARM1_NEG_ALARM1_MASK  (0x2U)
#define GDET_GDET_RFORCE_ALARM1_NEG_ALARM1_SHIFT (1U)
/*! NEG_ALARM1 - Negative alarm.
 *  0b0..No negative alarm pulse.
 *  0b1..Forces a negative alarm pulse.
 */
#define GDET_GDET_RFORCE_ALARM1_NEG_ALARM1(x)    (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RFORCE_ALARM1_NEG_ALARM1_SHIFT)) & GDET_GDET_RFORCE_ALARM1_NEG_ALARM1_MASK)

#define GDET_GDET_RFORCE_ALARM1_RFU_MASK         (0xFFFFFFFCU)
#define GDET_GDET_RFORCE_ALARM1_RFU_SHIFT        (2U)
/*! RFU - Reserved. */
#define GDET_GDET_RFORCE_ALARM1_RFU(x)           (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RFORCE_ALARM1_RFU_SHIFT)) & GDET_GDET_RFORCE_ALARM1_RFU_MASK)
/*! @} */

/*! @name GDET_RSTATUS1 - GDET status readout. */
/*! @{ */

#define GDET_GDET_RSTATUS1_MIN1_MASK             (0x3FFU)
#define GDET_GDET_RSTATUS1_MIN1_SHIFT            (0U)
/*! MIN1 - Minimum result value. */
#define GDET_GDET_RSTATUS1_MIN1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RSTATUS1_MIN1_SHIFT)) & GDET_GDET_RSTATUS1_MIN1_MASK)

#define GDET_GDET_RSTATUS1_MAX1_MASK             (0xFFC00U)
#define GDET_GDET_RSTATUS1_MAX1_SHIFT            (10U)
/*! MAX1 - Maximum result value. */
#define GDET_GDET_RSTATUS1_MAX1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RSTATUS1_MAX1_SHIFT)) & GDET_GDET_RSTATUS1_MAX1_MASK)

#define GDET_GDET_RSTATUS1_REF1_MASK             (0x3FF00000U)
#define GDET_GDET_RSTATUS1_REF1_SHIFT            (20U)
/*! REF1 - Reference value. */
#define GDET_GDET_RSTATUS1_REF1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RSTATUS1_REF1_SHIFT)) & GDET_GDET_RSTATUS1_REF1_MASK)

#define GDET_GDET_RSTATUS1_RFU1_MASK             (0xC0000000U)
#define GDET_GDET_RSTATUS1_RFU1_SHIFT            (30U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RSTATUS1_RFU1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RSTATUS1_RFU1_SHIFT)) & GDET_GDET_RSTATUS1_RFU1_MASK)
/*! @} */

/*! @name GDET_RRESULT1 - GDET result. */
/*! @{ */

#define GDET_GDET_RRESULT1_RESULT1_MASK          (0x3FFU)
#define GDET_GDET_RRESULT1_RESULT1_SHIFT         (0U)
/*! RESULT1 - Result value. */
#define GDET_GDET_RRESULT1_RESULT1(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RRESULT1_RESULT1_SHIFT)) & GDET_GDET_RRESULT1_RESULT1_MASK)

#define GDET_GDET_RRESULT1_RFU_MASK              (0xFFFFC00U)
#define GDET_GDET_RRESULT1_RFU_SHIFT             (10U)
/*! RFU - Reserved. */
#define GDET_GDET_RRESULT1_RFU(x)                (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RRESULT1_RFU_SHIFT)) & GDET_GDET_RRESULT1_RFU_MASK)

#define GDET_GDET_RRESULT1_NEG_LAT1_MASK         (0x10000000U)
#define GDET_GDET_RRESULT1_NEG_LAT1_SHIFT        (28U)
/*! NEG_LAT1 - Latched negative alarm. */
#define GDET_GDET_RRESULT1_NEG_LAT1(x)           (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RRESULT1_NEG_LAT1_SHIFT)) & GDET_GDET_RRESULT1_NEG_LAT1_MASK)

#define GDET_GDET_RRESULT1_POS_LAT1_MASK         (0x20000000U)
#define GDET_GDET_RRESULT1_POS_LAT1_SHIFT        (29U)
/*! POS_LAT1 - Latched positive alarm. */
#define GDET_GDET_RRESULT1_POS_LAT1(x)           (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RRESULT1_POS_LAT1_SHIFT)) & GDET_GDET_RRESULT1_POS_LAT1_MASK)

#define GDET_GDET_RRESULT1_ERR_NEG1_MASK         (0x40000000U)
#define GDET_GDET_RRESULT1_ERR_NEG1_SHIFT        (30U)
/*! ERR_NEG1 - Negative alarm. */
#define GDET_GDET_RRESULT1_ERR_NEG1(x)           (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RRESULT1_ERR_NEG1_SHIFT)) & GDET_GDET_RRESULT1_ERR_NEG1_MASK)

#define GDET_GDET_RRESULT1_ERR_POS1_MASK         (0x80000000U)
#define GDET_GDET_RRESULT1_ERR_POS1_SHIFT        (31U)
/*! ERR_POS1 - Positive alarm. */
#define GDET_GDET_RRESULT1_ERR_POS1(x)           (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RRESULT1_ERR_POS1_SHIFT)) & GDET_GDET_RRESULT1_ERR_POS1_MASK)
/*! @} */

/*! @name GDET_RMARGIN1 - Margin and target definition. */
/*! @{ */

