zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_GDET.h
#define GDET_GDET_RMARGIN1_MNEG1_MASK            (0x3FFU)
#define GDET_GDET_RMARGIN1_MNEG1_SHIFT           (0U)
/*! MNEG1 - Negative margin. */
#define GDET_GDET_RMARGIN1_MNEG1(x)              (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MNEG1_SHIFT)) & GDET_GDET_RMARGIN1_MNEG1_MASK)

#define GDET_GDET_RMARGIN1_MPOS1_MASK            (0xFFC00U)
#define GDET_GDET_RMARGIN1_MPOS1_SHIFT           (10U)
/*! MPOS1 - Positive margin. */
#define GDET_GDET_RMARGIN1_MPOS1(x)              (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MPOS1_SHIFT)) & GDET_GDET_RMARGIN1_MPOS1_MASK)

#define GDET_GDET_RMARGIN1_TGT1_MASK             (0x3FF00000U)
#define GDET_GDET_RMARGIN1_TGT1_SHIFT            (20U)
/*! TGT1 - Target reference value. */
#define GDET_GDET_RMARGIN1_TGT1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_TGT1_SHIFT)) & GDET_GDET_RMARGIN1_TGT1_MASK)

#define GDET_GDET_RMARGIN1_RFU1_MASK             (0xC0000000U)
#define GDET_GDET_RMARGIN1_RFU1_SHIFT            (30U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RMARGIN1_RFU1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_RFU1_SHIFT)) & GDET_GDET_RMARGIN1_RFU1_MASK)
/*! @} */

/*! @name GDET_RREF1 - Reference limits for mode 0. */
/*! @{ */

#define GDET_GDET_RREF1_MIN_REF1_MASK            (0x3FFU)
#define GDET_GDET_RREF1_MIN_REF1_SHIFT           (0U)
/*! MIN_REF1 - Smallest allowed reference value. */
#define GDET_GDET_RREF1_MIN_REF1(x)              (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MIN_REF1_SHIFT)) & GDET_GDET_RREF1_MIN_REF1_MASK)

#define GDET_GDET_RREF1_MAX_REF1_MASK            (0xFFC00U)
#define GDET_GDET_RREF1_MAX_REF1_SHIFT           (10U)
/*! MAX_REF1 - Highest allowed reference value. */
#define GDET_GDET_RREF1_MAX_REF1(x)              (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MAX_REF1_SHIFT)) & GDET_GDET_RREF1_MAX_REF1_MASK)

#define GDET_GDET_RREF1_RFU1_MASK                (0xFFF00000U)
#define GDET_GDET_RREF1_RFU1_SHIFT               (20U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RREF1_RFU1(x)                  (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_RFU1_SHIFT)) & GDET_GDET_RREF1_RFU1_MASK)
/*! @} */

/*! @name GDET_RMARGIN1_MODE1 - Margin and target definition for mode 1. */
/*! @{ */

#define GDET_GDET_RMARGIN1_MODE1_MNEG1_MASK      (0x3FFU)
#define GDET_GDET_RMARGIN1_MODE1_MNEG1_SHIFT     (0U)
/*! MNEG1 - Negative margin. */
#define GDET_GDET_RMARGIN1_MODE1_MNEG1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE1_MNEG1_SHIFT)) & GDET_GDET_RMARGIN1_MODE1_MNEG1_MASK)

#define GDET_GDET_RMARGIN1_MODE1_MPOS1_MASK      (0xFFC00U)
#define GDET_GDET_RMARGIN1_MODE1_MPOS1_SHIFT     (10U)
/*! MPOS1 - Negative margin. */
#define GDET_GDET_RMARGIN1_MODE1_MPOS1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE1_MPOS1_SHIFT)) & GDET_GDET_RMARGIN1_MODE1_MPOS1_MASK)

#define GDET_GDET_RMARGIN1_MODE1_TGT1_MASK       (0x3FF00000U)
#define GDET_GDET_RMARGIN1_MODE1_TGT1_SHIFT      (20U)
/*! TGT1 - Target reference value. */
#define GDET_GDET_RMARGIN1_MODE1_TGT1(x)         (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE1_TGT1_SHIFT)) & GDET_GDET_RMARGIN1_MODE1_TGT1_MASK)

#define GDET_GDET_RMARGIN1_MODE1_RFU1_MASK       (0xC0000000U)
#define GDET_GDET_RMARGIN1_MODE1_RFU1_SHIFT      (30U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RMARGIN1_MODE1_RFU1(x)         (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE1_RFU1_SHIFT)) & GDET_GDET_RMARGIN1_MODE1_RFU1_MASK)
/*! @} */

/*! @name GDET_RREF1_MODE1 - Reference limits for mode 1. */
/*! @{ */

#define GDET_GDET_RREF1_MODE1_MIN_REF1_MASK      (0x3FFU)
#define GDET_GDET_RREF1_MODE1_MIN_REF1_SHIFT     (0U)
/*! MIN_REF1 - Smallest allowed reference value. */
#define GDET_GDET_RREF1_MODE1_MIN_REF1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MODE1_MIN_REF1_SHIFT)) & GDET_GDET_RREF1_MODE1_MIN_REF1_MASK)

#define GDET_GDET_RREF1_MODE1_MAX_REF1_MASK      (0xFFC00U)
#define GDET_GDET_RREF1_MODE1_MAX_REF1_SHIFT     (10U)
/*! MAX_REF1 - Highest allowed reference value. */
#define GDET_GDET_RREF1_MODE1_MAX_REF1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MODE1_MAX_REF1_SHIFT)) & GDET_GDET_RREF1_MODE1_MAX_REF1_MASK)

#define GDET_GDET_RREF1_MODE1_RFU1_MASK          (0xFFF00000U)
#define GDET_GDET_RREF1_MODE1_RFU1_SHIFT         (20U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RREF1_MODE1_RFU1(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MODE1_RFU1_SHIFT)) & GDET_GDET_RREF1_MODE1_RFU1_MASK)
/*! @} */

/*! @name GDET_RMARGIN1_MODE2 - Margin and target definition for mode 2. */
/*! @{ */

#define GDET_GDET_RMARGIN1_MODE2_MNEG1_MASK      (0x3FFU)
#define GDET_GDET_RMARGIN1_MODE2_MNEG1_SHIFT     (0U)
/*! MNEG1 - Negative margin. */
#define GDET_GDET_RMARGIN1_MODE2_MNEG1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE2_MNEG1_SHIFT)) & GDET_GDET_RMARGIN1_MODE2_MNEG1_MASK)

#define GDET_GDET_RMARGIN1_MODE2_MPOS1_MASK      (0xFFC00U)
#define GDET_GDET_RMARGIN1_MODE2_MPOS1_SHIFT     (10U)
/*! MPOS1 - Negative margin. */
#define GDET_GDET_RMARGIN1_MODE2_MPOS1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE2_MPOS1_SHIFT)) & GDET_GDET_RMARGIN1_MODE2_MPOS1_MASK)

#define GDET_GDET_RMARGIN1_MODE2_TGT1_MASK       (0x3FF00000U)
#define GDET_GDET_RMARGIN1_MODE2_TGT1_SHIFT      (20U)
/*! TGT1 - Target reference value. */
#define GDET_GDET_RMARGIN1_MODE2_TGT1(x)         (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE2_TGT1_SHIFT)) & GDET_GDET_RMARGIN1_MODE2_TGT1_MASK)

#define GDET_GDET_RMARGIN1_MODE2_RFU1_MASK       (0xC0000000U)
#define GDET_GDET_RMARGIN1_MODE2_RFU1_SHIFT      (30U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RMARGIN1_MODE2_RFU1(x)         (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RMARGIN1_MODE2_RFU1_SHIFT)) & GDET_GDET_RMARGIN1_MODE2_RFU1_MASK)
/*! @} */

/*! @name GDET_RREF1_MODE2 - Reference limits for mode 2. */
/*! @{ */

#define GDET_GDET_RREF1_MODE2_MIN_REF1_MASK      (0x3FFU)
#define GDET_GDET_RREF1_MODE2_MIN_REF1_SHIFT     (0U)
/*! MIN_REF1 - Smallest allowed reference value. */
#define GDET_GDET_RREF1_MODE2_MIN_REF1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MODE2_MIN_REF1_SHIFT)) & GDET_GDET_RREF1_MODE2_MIN_REF1_MASK)

#define GDET_GDET_RREF1_MODE2_MAX_REF1_MASK      (0xFFC00U)
#define GDET_GDET_RREF1_MODE2_MAX_REF1_SHIFT     (10U)
/*! MAX_REF1 - Highest allowed reference value. */
#define GDET_GDET_RREF1_MODE2_MAX_REF1(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MODE2_MAX_REF1_SHIFT)) & GDET_GDET_RREF1_MODE2_MAX_REF1_MASK)

#define GDET_GDET_RREF1_MODE2_RFU1_MASK          (0xFFF00000U)
#define GDET_GDET_RREF1_MODE2_RFU1_SHIFT         (20U)
/*! RFU1 - Reserved. */
#define GDET_GDET_RREF1_MODE2_RFU1(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_RREF1_MODE2_RFU1_SHIFT)) & GDET_GDET_RREF1_MODE2_RFU1_MASK)
/*! @} */

/*! @name GDET_DLY_CTRL - GDET delay control. */
/*! @{ */

#define GDET_GDET_DLY_CTRL_VOL_SEL_MASK          (0x3U)
#define GDET_GDET_DLY_CTRL_VOL_SEL_SHIFT         (0U)
/*! VOL_SEL - (Voltage) mode selection.
 *  0b00..Drive mode 0.
 *  0b01..Drive mode 1.
 *  0b10..Drive mode 2.
 *  0b11..Drive mode 3.
 */
#define GDET_GDET_DLY_CTRL_VOL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_DLY_CTRL_VOL_SEL_SHIFT)) & GDET_GDET_DLY_CTRL_VOL_SEL_MASK)

#define GDET_GDET_DLY_CTRL_SW_VOL_CTRL_MASK      (0x4U)
#define GDET_GDET_DLY_CTRL_SW_VOL_CTRL_SHIFT     (2U)
/*! SW_VOL_CTRL - Software voltage mode selection.
 *  0b0..HW control through volt_sel input pin.
 *  0b1..SW SFR control through GDET_DLY_CTRL.VOL_SEL.
 */
#define GDET_GDET_DLY_CTRL_SW_VOL_CTRL(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_DLY_CTRL_SW_VOL_CTRL_SHIFT)) & GDET_GDET_DLY_CTRL_SW_VOL_CTRL_MASK)

