zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_GDET.h
#define GDET_GDET_DLY_CTRL_RFU_MASK              (0xFFFFFFF8U)
#define GDET_GDET_DLY_CTRL_RFU_SHIFT             (3U)
/*! RFU - Reserved. */
#define GDET_GDET_DLY_CTRL_RFU(x)                (((uint32_t)(((uint32_t)(x)) << GDET_GDET_DLY_CTRL_RFU_SHIFT)) & GDET_GDET_DLY_CTRL_RFU_MASK)
/*! @} */

/*! @name GDET_CTRL_CLR - GDET clear control. */
/*! @{ */

#define GDET_GDET_CTRL_CLR_SFT_RST_MASK          (0x1U)
#define GDET_GDET_CTRL_CLR_SFT_RST_SHIFT         (0U)
/*! SFT_RST - Soft reset. */
#define GDET_GDET_CTRL_CLR_SFT_RST(x)            (((uint32_t)(((uint32_t)(x)) << GDET_GDET_CTRL_CLR_SFT_RST_SHIFT)) & GDET_GDET_CTRL_CLR_SFT_RST_MASK)

#define GDET_GDET_CTRL_CLR_RFU_MASK              (0xFFFFFFFEU)
#define GDET_GDET_CTRL_CLR_RFU_SHIFT             (1U)
/*! RFU - Reserved. */
#define GDET_GDET_CTRL_CLR_RFU(x)                (((uint32_t)(((uint32_t)(x)) << GDET_GDET_CTRL_CLR_RFU_SHIFT)) & GDET_GDET_CTRL_CLR_RFU_MASK)
/*! @} */

/*! @name GDET_IP_VERSION - IP Version. */
/*! @{ */

#define GDET_GDET_IP_VERSION_Z_MASK              (0xFU)
#define GDET_GDET_IP_VERSION_Z_SHIFT             (0U)
/*! Z - Extended revision number. */
#define GDET_GDET_IP_VERSION_Z(x)                (((uint32_t)(((uint32_t)(x)) << GDET_GDET_IP_VERSION_Z_SHIFT)) & GDET_GDET_IP_VERSION_Z_MASK)

#define GDET_GDET_IP_VERSION_Y2_MASK             (0xF0U)
#define GDET_GDET_IP_VERSION_Y2_SHIFT            (4U)
/*! Y2 - Minor revision number 2. */
#define GDET_GDET_IP_VERSION_Y2(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_IP_VERSION_Y2_SHIFT)) & GDET_GDET_IP_VERSION_Y2_MASK)

#define GDET_GDET_IP_VERSION_Y1_MASK             (0xF00U)
#define GDET_GDET_IP_VERSION_Y1_SHIFT            (8U)
/*! Y1 - Minor revision number 1. */
#define GDET_GDET_IP_VERSION_Y1(x)               (((uint32_t)(((uint32_t)(x)) << GDET_GDET_IP_VERSION_Y1_SHIFT)) & GDET_GDET_IP_VERSION_Y1_MASK)

#define GDET_GDET_IP_VERSION_X_MASK              (0xF000U)
#define GDET_GDET_IP_VERSION_X_SHIFT             (12U)
/*! X - Major revision number. */
#define GDET_GDET_IP_VERSION_X(x)                (((uint32_t)(((uint32_t)(x)) << GDET_GDET_IP_VERSION_X_SHIFT)) & GDET_GDET_IP_VERSION_X_MASK)

#define GDET_GDET_IP_VERSION_MILESTONE_MASK      (0x30000U)
#define GDET_GDET_IP_VERSION_MILESTONE_SHIFT     (16U)
/*! MILESTONE - Release milestone.
 *  0b00..IP Pre-release.
 *  0b01..IP Bronze-release.
 *  0b10..IP Silver-release.
 *  0b11..IP Gold-release.
 */
#define GDET_GDET_IP_VERSION_MILESTONE(x)        (((uint32_t)(((uint32_t)(x)) << GDET_GDET_IP_VERSION_MILESTONE_SHIFT)) & GDET_GDET_IP_VERSION_MILESTONE_MASK)

#define GDET_GDET_IP_VERSION_RFU_MASK            (0xFFFC0000U)
#define GDET_GDET_IP_VERSION_RFU_SHIFT           (18U)
/*! RFU - Reserved. */
#define GDET_GDET_IP_VERSION_RFU(x)              (((uint32_t)(((uint32_t)(x)) << GDET_GDET_IP_VERSION_RFU_SHIFT)) & GDET_GDET_IP_VERSION_RFU_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group GDET_Register_Masks */


/*!
 * @}
 */ /* end of group GDET_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_GDET_H_ */

